In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("C:/Users/ELCOT/Downloads/archive/Mall_Customers.csv")
print(df.head())
print(df.info())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB
None

In [18]:
df.isnull().sum()
df.dropna()
df.fillna(0)

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    male   19                  15                      39
1             2    male   21                  15                      81
2             3  female   20                  16                       6
3             4  female   23                  16                      77
4             5  female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  female   35                 120                      79
196         197  female   45                 126                      28
197         198    male   32                 126                      74
198         199    male   32                 137                      18
199         200    male   30                 137                      83

[200 rows x 5 columns]

In [6]:
df = df.drop_duplicates()

In [8]:
df['Genre'].unique()

array(['Male', 'Female'], dtype=object)

In [10]:
df['Genre'] = df['Genre'].str.strip().str.lower()

In [21]:
df['Age'] = df['Age'].fillna(df['Age'].mean())     # fill with mean
df['Age'] = df['Age'].fillna(df['Age'].median())   # fill with median
df['Genre'] = df['Genre'].fillna(df['Genre'].mode()[0])   # fill with mode

In [22]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customerid              200 non-null    int64
 1   genre                   200 non-null    object
 2   age                     200 non-null    int64
 3   annual_income_(k$)      200 non-null    int64
 4   spending_score_(1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 9.4+ KB

In [26]:
df['age'] = df['age'].astype(int)

In [28]:
df.to_csv("mall_customers_cleaned.csv", index=False)

In [29]:
print(df.isnull().sum())

customerid                0
genre                     0
age                       0
annual_income_(k$)        0
spending_score_(1-100)    0
dtype: int64